# IdeaStatiCa.ConnectionApi.Model.ConContactGridOperation

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**ConnectedItems** | **List&lt;ConConnectedItem&gt;** |  | [optional]
**FoundationBlock** | **ConFoundationBlockDto** |  | [optional]
**PlateSide** | **ConPlateSide** |  | [optional]
**IsImported** | **bool** |  | [optional]
**OperationType** | **string** |  | [optional]
**Id** | **int** |  | [optional]
**Name** | **string** |  | [optional]
**Active** | **bool** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)